In [1]:
import pandas as pd
print(pd.__version__)

2.2.2

In [2]:
data = {'nama':['Didi Kempot', 'Glen Fedly', 'Mbah Surip'],
        'tempat_kelahiran':['Surakarta, Jawa Tengah', 'Jakarta, DKI Jakarta', 'Mojokerto, Jawa Timur']}
df = pd.DataFrame(data)
df

          nama        tempat_kelahiran
0  Didi Kempot  Surakarta, Jawa Tengah
1   Glen Fedly    Jakarta, DKI Jakarta
2   Mbah Surip   Mojokerto, Jawa Timur

In [3]:
df[['nama_depan', 'nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

          nama        tempat_kelahiran nama_depan nama_belakang
0  Didi Kempot  Surakarta, Jawa Tengah       Didi        Kempot
1   Glen Fedly    Jakarta, DKI Jakarta       Glen         Fedly
2   Mbah Surip   Mojokerto, Jawa Timur       Mbah         Surip

In [6]:
df[['kota', 'propinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,propinsi
0,Didi Kempot,"Surakarta, Jawa Tengah",Didi,Kempot,Surakarta,Jawa Tengah
1,Glen Fedly,"Jakarta, DKI Jakarta",Glen,Fedly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojokerto, Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur